Repository: ktechlab/ktechlab
Catalog: po/*/ktechlab.po
Languages: eo, he

source: All functions in the source file will be compiled as reentrant, i.e. the parameters and local variables will be allocated on the stack. If this option is used all source files in the project should be compiled with this option. It automatically implies --int-long-reent and --float-reent.
he: כל הפונקציות בקובץ המקור תהודרנה כרבות־כניסה, כלומר שכל הפרמטרים והמשתנים המקומיים יוקצו בערימה. אם האפשרות הזאת בשימוש יש להדר את כל קובצי המקור במיזם הזה עם האפשרות הזאת. היא גורמת להסקה אוטומטי של ‎--int-long-reent ושל ‎--float-reent.

source: Stack auto&matic variables (--stack-auto)
eo: Staki aŭto&matajn variablojn (--stack-auto)
he: &ערימת משתנים אוטומטית (‎--stack-auto)

source: Integer li&braries were compiled as reentrant (--int-long-reent)
eo: Entjerbi&bliotekoj estis kompilitaj kiel reenirebla (--int-long-reent)
he: &ספריות מספרים שלמים וחיוביים הודרו בתור רב־כניסה (‎--int-long-reent)

source: Floating point library is compiled as reentrant.
eo: Glitkoma biblioteko estas kompilita kiel reenirebla.
he: ספריית הנקודה הצפה הודרה בתור רב־כניסה.

source: Floating point librar&y was compiled as reentrant (--float-reent)
eo: Glitkoma bibl&ioteko estis kompilita kiel reenirebla (--float-reent)
he: ספריית הנקודה ה&צפה הודרה בתור רב־כניסה (‎--float-reent)

source: Leave out the frame pointer (--fommit-frame-pointer)
eo: Forlasi la kadromontrilon (--fomit-frame-pointer)
he: להשאיר את מצביע המסגרת כמו שהוא (‎--fommit-frame-pointer)

source: Will not memcpy initialized data from code space into xdata space. This saves a few bytes in code space if you do not have initialized data.
he: לא יבוצע memcpy (העתקת זיכרון) ממרחב הקוד (code) למרחב xdata. שומר כמה בתים במרחב הקוד אם אין לך מידע מאותחל.

source: Do not memcpy initialized &xram from code (--no-xinit-opt)
eo: Ne memcpy pravigis &xram de kodo (--no-xinit-opt)
he: לא לבצע memcpy של xram מ&אותחל מהקוד (‎--no-xinit-opt)

source: Callee will &always save registers used (--all-callee-saves)
eo: Alvokito &ĉiam konservos la uzitajn registrojn (--all-callee-saves)
he: הקורא &תמיד ישמור את האוגרים שהיו בשימוש (‎--all-callee-saves)

source: &Optimization
eo: &Optimumigo
he: מי&טוב

source: The compiler will not overlay parameters and local variables of any function, see section Parameters and local variables for more details.
he: המהדר לא ידרוס פרמטרים ומשתנים מקומיים של כל פונקציה שהיא, יש לעיין בסעיף פרמטרים ומשתנים מקומיים לפרטים נוספים.

source: Disable the GCSE optimization (--nogcse)
eo: Malebligi la GCSE-optimumigon (--nogcse)
he: השבתת מיטובי GCSE‏ (‎--nogcse)

source: Will not optimize labels (makes the dumpfiles more readable).
eo: Ne optimumigos etikedojn (igas la dumpdosieroj pli legeblaj).
he: התוויות לא תמוטבנה (הפיכת קובצי ההיטל לקריאים יותר).

source: Disable label optimi&zation (--nolabelopt)
eo: Malebligi etikedoptimumi&gon (--nolabelopt)
he: השבתת מי&טוב תוויות (‎--nolabelopt)

source: Disable optimization of invariants (--noinvariant)
eo: Malebligi optimumigo de invariantoj (--noinvariant)
he: השבתת מיטוב משתמרים/אינווריאנטים (‎--noinvariant)

source: Disable peep-hole optimization.
eo: Malebligi peep-truan optimumigon.
he: השבתת מיטוב „חור הצצה”.

source: Disable peep-hole optimization (--&no-peep)
eo: Malebligi optimumigon de kaŝtruo (--&no-peep)
he: השבתת מיטוב „&חור הצצה”/peep-hole ‏‎(--no-peep)

source: Will not do loop reversal optimization.
eo: Ne faros buklan inversan optimumigon.
he: לא יבצע מיטוב היפוך לולאה.

source: Disable loop reverse optimization (--noloopreverse)
eo: Malebligi buklan inversan optimumigon (--noloopreverse)
he: השבתת מיטוב היפוך לולאה (‎--noloopreverse)

source: The compiler will optimize code generation towards compact code, possibly at the expense of code speed.
he: המהדר ימטב את יצירת הקוד לטובת קוד חסכוני, כנראה על חשבון מהירות הקוד.

source: Opti&mize for compact code (--opt-code-size)
eo: Optimu&migi por kompakta kodo (--otp-code-size)
he: מיטוב לקוד &חסכוני (‎--opt-code-size)

source: The compiler will optimize code generation towards fast code, possibly at the expense of code size.
he: המהדר ימטב את יצירת הקוד לטובת קוד מהיר, כנראה על חשבון גודל הקוד.

source: &Optimize for fast code (--opt-code-speed)
eo: &Optimumigi por rapida kodo (--otp-code-speed)
he: מיטוב ל&קוד מהיר (‎--opt-code-speed)

source: Do not generate boundary check for &jump tables (--nojtbound)
eo: Ne krei limkontrolon por &salti tabelojn (--nojtbound)
he: לא לייצר בדיקת גבולות לטבלאות &קפיצה (‎--nojtbound)

source: PIC&16 Specific
eo: PIC&16 Specifa
he: יי&עודי ל־PIC16

source: Do not use default libraries (--nodefaultlibs)
eo: Ne uzi defaŭltajn bibliotekojn (--nodefaultlibs)
he: לא להשתמש בספריות ברירת המחדל (‎--nodefaultlibs)

source: Do not generate BANKSEL directives (--pno-banksel)
eo: Ne generi BANKSEL-direktivojn (--pno-banksel)
he: לא לייצר הנחיות BANKSEL ‏(‎--pno-banksel)

source: Use large stac&k model (--pstack-model=large)
eo: Uzi grandan sta&k-modelon (--pstack-model=granda)
he: להשתמש בדגם &ערימה גדול (‎--pstack-model=large)

source: Show more debug info in assembl&y output (--debug-xtra)
eo: Montri pliajn sencimigajn informojn en assembl&y-produktaĵo (--debug-xtra)
he: הצגת פרטי ניפוי &שגיאות נוספים בפלט האסמבלי (‎--debug-xtra)

source: E&xplicit enable of peepholes (--denable-peeps)
eo: E&ksplicita ebligo de okultruoj (--denable-peeps)
he: הפעלה מפורשת של &חורי הצצה (‎--denable-peeps)

source: Du&mp call tree in .calltree file (--calltree)
eo: Elĵeti vokarbo&n en .calltree-dosieron (--calltree)
he: להטיל את עץ הקריאות לקובץ ‎.calltree‏ (‎--calltree)

source: Ena&ble stack optimizations (--fstack)
eo: E&bligi stakajn optimumigojn (--fstack)
he: הפעלת מיטובי &ערימה (‎--fstack)

source: Try to use conditional BRA instead of GOTO (--optimi&ze-goto)
eo: Provi uzi kondiĉan BRA anstataŭ GOTO (--optimi&ze-goto)
he: לנסות להשתמש ב־BRA מו&תנה במקום GOTO‏ (‎--optimize-goto)

source: Try to optimize some compares (--optimize-cmp)
eo: Provi optimumigi kelkajn komparojn (--optimize-cmp)
he: לנסות למטב חלק מההשוואות (‎--optimize-cmp)

source: Thorough data flow analysis (resource intensive) (--optimize-df)
eo: Detala analizo de datumfluo (intensa rimedo) (--optimize-df)
he: ניתוח מפורט של זרימת נתונים (זולל משאבים) (‎--optimize-df)

source: SDCC install prefix:
eo: SDCC instala prefikso:
he: קידומת התקנת SDCC:

source: Location where SDCC in installed. Empty for system default.
eo: Loko kie SDCC estas instalita. Malplena por sistema defaŭlta.
he: המקום בו SDCC מותקן. ריק ישתמש בברירת המחדל של המערכת.

source: General
eo: Ĝenerala
he: כללי

source: General Options
eo: Ĝeneralaj opcioj
he: אפשרויות כלליות

source: Programmer
eo: Programisto
he: מתכנת

source: Formatter
eo: Formatisto
he: מעצב

source: Assembly Formatter
eo: Asemblea Formatilo
he: מעצב אסמבלי

source: Electronic Logic Values
eo: Elektronikaj Logikaj Valoroj
he: רכיבים לוגיים אלקטרוניים

source: Medium (%1 FPS)
eo: Meza (%1 FPS)
he: בינוני (%1 תמוניות לשנייה)

source: High (%1 FPS)
eo: Alta (%1 FPS)
he: גבוה (%1 תמוניות לשנייה)

source: Highest (%1 FPS)
eo: Plej alta (%1 FPS)
he: הגבוה ביותר (%1 תמוניות לשנייה)

source: Unknown value
eo: Nekonata valoro
he: ערך לא ידוע

source: <b>%1</b> cannot be found.<br>
eo: <b>%1</b> ne troveblas.<br>
he: <b>%1</b> לא נמצא.<br>

source: <b>%1</b> found: %2<br>
eo: <b>%1</b> trovita: %2<br>
he: <b>%1</b> נמצא: %2<br>

source: Remove programmer configuration "%1"?
eo: Ĉu forigi programistan agordon "%1"?
he: להסיר את הגדרות הצורב „%1”?

source: Remove "%1"
eo: Forigi "%1"
he: הסרת „%1”

source: Configuration Name
eo: Nomo de agordo
he: שם ההגדרה

source: Value radix:
eo: Valorradikso:
he: בסיס ערך:

source: Automatic
eo: Aŭtomate
he: אוטומטי

source: Manual
eo: Manuma
he: ידני

source: Connection Routing Mode
eo: Konekta Voja Reĝimo
he: מצב ניתוב חיבור

source: <b>Manual</b> connection routing enabled.
eo: <b>Manlibro</b> konektovojigo ebligita.
he: ניתוב חיבור <b>ידני</b> מופעל.

source: <b>Automatic</b> connection routing enabled.
eo: <b>Aŭtomata</b> konektovojigo ebligita.
he: ניתוב חיבור <b>אוטומטי</b> מופעל.

source: Alignment
eo: Vicigo
he: יישור

source: SVG export is sub-functional
eo: SVG-eksporto estas subfunkcia
he: ייצוא SVG עובד חלקית

source: There is nothing to crop
eo: Estas nenio por tondi
he: אין מה לחתוך

source: Export failed
eo: Eksporto malsukcesis
he: הייצוא נכשל

source: Image Export
eo: Bilda Eksporto
he: ייצוא תמונה

source: Could not open %1 for reading
eo: Ne eblis malfermi %1 por legado
he: לא ניתן לפתוח את %1 לקריאה

source: Could not parse XML: %1
he: לא ניתן לפענח XML: %1

source: Could not open '%1' for writing. Check that you have write permissions
eo: Ne eblis malfermi '%1' por skribado. Kontrolu, ke vi havas skribpermesojn
he: לא ניתן לפתוח את ‚%1’ לכתיבה. נא לבדוק שיש לך הרשאות כתיבה

source: Saving File
eo: Konservante Dosieron
he: קובץ נשמר

source: This help item does not yet exist for the %1 language. Help out with KTechlab by creating one via the "Edit" button.
he: פריט העזרה הזה לא קיים עדיין לשפה %1. אפשר לסייע ל־KTechlab על ידי יצירתו דרך כפתור ה„עריכה”.

source: Could not open item descriptions file "%1" for writing.
eo: Ne eblis malfermi eron priskribodosieron "%1" por skribado.
he: לא ניתן לפתוח את קובץ תיאור הפריטים „%1” לכתיבה.

source: Cancel
eo: Nuligi
he: ביטול

source: Delete
eo: Forigi
he: מחיקה

source: Export as Image...
eo: Eksporti kiel Bildon...
he: ייצוא כתמונה…

source: Align Horizontally
eo: Vicigi Horizontale
he: יישור אופקי

source: Align Vertically
eo: Vicigi Vertikale
he: יישור אנכי

source: Distribute Horizontally
eo: Distribui Horizontale
he: פיזור אופקי

source: Distribute Vertically
eo: Distribui Vertikale
he: פיזור אנכי

source: Draw
eo: Egaliĝo
he: ציור

source: Raise Selection
eo: Levi Elekton
he: הגבהת הבחירה

source: Lower Selection
eo: Mallevi Elekto
he: הנמכת הבחירה

source: Left click to add. Right click to resume normal editing
eo: Maldekstre alklaku por aldoni. Dekstre alklaku por rekomenci normalan redaktadon
he: לחיצה שמאלית להוספה. לחיצה ימנית לחזרה לעריכה רגילה

source: Click and hold to start drawing.
eo: Alklaku kaj tenu prenu por komenci desegni.
he: לחיצה והחזקה להתחלת ציור.

source: Right click to cancel the connector
eo: Dekstre alklaku por nuligi la konektilon
he: לחיצה ימנית לביטול המחבר

source: Behavior
eo: Konduto
he: התנהגות

source: Make Non-Persistent
eo: Igi Ne-Persista
he: שחרור

source: Make Persistent
eo: Igi Persista
he: קיבוע

source: Move To
eo: Movi al
he: העברה אל

source: Left Sidebar
eo: Maldekstra flankmenuo
he: סרגל שמאלי

source: Right Sidebar
eo: Desktra flankmenuo
he: סרגל ימני

source: Top Sidebar
eo: Supra flankmenuo
he: סרגל עליון

source: Bottom Sidebar
eo: Malsupra flankmenuo
he: סרגל תחתון

source: Project
eo: Projekto
he: מיזם

source: Components
eo: Komponentoj
he: רכיבים

source: Mechanics
eo: Mekaniko
he: מכניקה

source: Item Editor
eo: Objektredaktoro
he: עורך פריטים

source: Context Help
eo: Kunteksthelpo
he: עזרה לפי הקשר

source: Messages
eo: Mesaĝoj
he: הודעות

source: Symbol Viewer
eo: Simbolvidigilo
he: מציג סמלים

source: Scope Screen (Very Rough)
eo: Ekrano de Amplekso (Tre Kruda)
he: מסך סקופ (גס מאוד)

source: &New
eo: &Nova
he: &חדש

source: C source
eo: C fonto
he: מקור ב־C

source: New Project...
eo: Nova Projekto...
he: מיזם חדש…

source: Open Project...
eo: Malfermi Projekton...
he: פתיחת מיזם…

source: Open &Recent Project...
eo: Malfe&rmi Lastatempan Projekton...
he: פתיחת המיזם ה&אחרון…

source: Export to Makefile...
eo: Eksporti al Makefile...
he: ייצוא ל־Makefile…

source: Create Subproject...
eo: Krei subprojekton...
he: יצירת תת־מיזם…

source: Add Existing File...
eo: Aldoni Ekzistantan Dosieron...
he: הוספת קובץ קיים…

source: Add Current File...
eo: Aldoni Nunan Dosieron...
he: הוספת קובץ נוכחי…

source: Close Project
eo: Fermi Projekton
he: סגירת מיזם

source: Remove from Project
eo: Forigi el Projekto
he: הסרה מהמיזם

source: Insert Existing File...
eo: Enigi Ekzistantan Dosieron...
he: הוספת קובץ קיים…

source: Insert Current File...
eo: Enigi Nunan Dosieron...
he: הוספת הקובץ הנוכחי…

source: Linker Options...
eo: Ligilaj Opcioj...
he: אפשרויות מקשר…

source: Build...
eo: Konstruu...
he: בנייה…

source: Upload...
eo: Alŝuti...
he: העלאה…

source: Processing Options...
eo: Procesaj Opcioj...
he: אפשרויות עיבוד…

source: Split View Left/Right
eo: Dividi rigardon vertikale
he: פיצול התצוגה לימין/שמאל

source: Split View Top/Bottom
eo: Dividi rigardon horizontale
he: פיצול התצוגה ללמעלה/למטה

source: Run Simulation
eo: Ruli Simuladon
he: הפעלת הדמיה

source: Pause Simulation
eo: Paŭzi Simuladon
he: השהיית הדמיה

source: Internals
eo: Internaloj
he: פנימיים

source: Square Wave
eo: Kvadrata Ondo
he: גל ריבועי

source: 2-Way Switch
eo: 2-Voja Ŝaltilo
he: מתג דו־מצבי

source: 3-Way Switch
eo: 3-Voja Ŝaltilo
he: מתג תלת־מצבי

source: LRC
he: מעגל RLC

source: Resistors in Parallel
eo: Rezistoj en Paralelo
he: נגדים במקביל

source: Resistors in Series
eo: Rezistoj en Serio
he: מקבילים בטור

source: Voltage Divider
eo: Tensiodividilo
he: מחלק מתח

source: Full Wave Rectifier
eo: Plena Ondo Rektifilo
he: מיישר גל מלא

source: Half Wave Rectifier
eo: Duononda Rektifilo
he: מיישר חצי גל

source: Decoupler
eo: Malkunliga
he: מבודד אופטי

source: Inverting Amplifier
eo: Inversa Amplifilo
he: מגבר הופך

source: Noninverting Amplifier
eo: Neinversa Amplifilo
he: מגבר לא הופך

source: Instrumentation Amplifier
eo: Instrumentada Amplifilo
he: מגבר מכשור

source: Astable Multivibrator
eo: Stable Multivibrator
he: רב־רטט אל־יציב

source: Schmitt Trigger
he: מעגל שמיט

source: Switch
eo: Ŝalti
he: מתג

source: Close
eo: Fermi
he: סגירה

source: Save
eo: Konservi
he: שמירה

source: Reload
eo: Reŝargi
he: ריענון

source: Close All Others
eo: Fermi Ĉiujn Aliajn
he: לסגור את כל האחרים

source: Intel Hex
he: הקסה של אינטל

source: Open Location
eo: Malfermi lokon
he: פתיחת מקום

source: Exiting...
eo: Finante...
he: יציאה…

source: &Tools
eo: &Iloj
he: &כלים

source: Routing Mode
eo: Voja Reĝimo
he: מצב ניתוב

source: &File
eo: &Dosiero
he: &קובץ

source: &Edit
eo: R&edakti
he: &עריכה

source: &View
eo: &Vido
he: ת&צוגה

source: Tools
eo: Iloj
he: כלים

source: &Code Folding
eo: &Kodfaldado
he: &קיפול קוד

source: &Settings
eo: &Agordoj
he: ה&גדרות

source: Main Toolbar
eo: Ĉefa ilobreto
he: סרגל כלים ראשי

source: &Debug
eo: Sen&cimigo
he: &ניפוי שגיאות

source: Debugger
eo: Sencimigilo
he: מנפה שגיאות

source: &Project
eo: &Projekto
he: מי&זם

source: Examples
eo: Ekzemploj
he: דוגמאות

source: Basic
eo: Baza
he: בסיסי

source: Diodes
eo: Diodoj
he: דיודות

source: Matrix Display Drivers
eo: Matric-Ekranaj Peliloj
he: מנהלי תצוגות מטריצה

source: Transistors
eo: Transistoroj
he: טרנזיסטורים

source: *** Microbe generation successful ***
eo: *** Mikroba generacio sukcesa ***
he: *** יצירת Microbe הצליחה ***

source: *** Microbe generation failed ***
eo: *** Mikroba generacio malsukcesis ***
he: *** יצירת Microbe נכשלה ***

source: Warning: Floating connection for %1
eo: Averto: flosanta konekto por %1
he: אזהרה: חיבורים צפים עבור %1

source: KTechlab was unable to find the "Start" part. This must be included as the starting point for your program.
he: KTechlab לא הצליח למצוא את החלק „Start”. יש לכלול אותו בנקודת ההתחלה של התוכנית שלך.

source: *** Assembly successful ***
eo: *** Asembleo sukcesa ***
he: *** האסמבלי הצליח ***

source: *** Assembly failed ***
eo: *** Asembleo malsukcesis ***
he: *** האסמבלי נכשל ***

source: Assembly failed. Please check you have gputils installed.
eo: Asembleo malsukcesis. Bonvolu kontroli, ke vi havas gputils instalitaj.
he: האסמבלי נכשל. נא לוודא שמותקן אצלך gputils.

source: *** Disassembly successful ***
eo: *** Malmuntado sukcesa ***
he: *** פירוק האסמבלי הצליח ***

source: *** Disassembly failed ***
eo: *** Malmuntado malsukcesis ***
he: *** פירוק האסמבלי נכשל ***

source: Disassembly failed. Please check you have gputils installed.
eo: Malmuntado malsukcesis. Bonvolu kontroli, ke vi havas gputils instalitaj.
he: פירוק האסמבלי נכשל. נא לוודא שמותקן אצלך gputils.

source: *** Archiving successful ***
eo: *** Arkivado sukcesa ***
he: *** אריזה בארכיון הצליחה ***

source: *** Archiving failed ***
eo: *** Arkivado malsukcesis ***
he: *** אריזה בארכיון נכשלה ***

source: Linking failed. Please check you have gputils installed.
eo: Ligo malsukcesis. Bonvolu kontroli, ke vi havas gputils instalitaj.
he: הקישור נכשל. נא לוודא שמותקן אצלך gputils.

source: *** Linking successful ***
eo: *** Ligo sukcesa ***
he: *** הקישור הצליח ***

source: *** Linking failed ***
eo: *** Ligo malsukcesis ***
he: *** הקישור נכשל ***

source: These messages show the output of language-related functionality such as compiling and assembling.<br><br>For error messages, clicking on the line will automatically open up the file at the position of the error.
he: ההודעות האלו מציגות את פלט השימוש תלוי השפה כגון הידור ואיסוף.<br><br>להודעות שגיאה, לחיצה על השורה תפתח את הקובץ בנקודת השגיאה אוטומטית.

source: *** Compilation failed ***
eo: *** Kompilo malsukcesis ***
he: *** ההידור נכשל ***

source: *** Compilation successful ***
eo: *** Kompilo sukcesa ***
he: *** ההידור הצליח ***

source: Assembly failed. Please check you have KTechlab installed properly ("microbe" could not be started).
he: האסמבלי נכשל. נא לוודא ש־KTechlab מותקן כראוי (לא ניתן להפעיל את „microbe”).

source: Supported programmers: %1
eo: Subtenataj programistoj: %1
he: צורבים נתמכים: %1

source: <br>Interface: Serial Port
eo: <br>Interfaco: Seria Pordo
he: <br>ממשק: פתחה טורית

source: <br>Interface: Parallel Port
eo: <br>Interfaco: Paralela Pordo
he: <br>ממשק: פתחה מקבילית

source: <br>Interface: USB Port
eo: <br>Interfaco: USB-Pordo
he: <br>ממשק: פתחת USB

source: <br>Interface: Serial Port and Parallel Port
eo: <br>Interfaco: Seria Pordo kaj Paralela Pordo
he: <br>ממשק: פתחה טורית ופתחה מקבילית

source: *** Programming successful ***
eo: *** Programado sukcesa ***
he: *** הצריבה הצליחה ***

source: *** Programming failed ***
eo: *** Programado malsukcesis ***
he: *** הצריבה נכשלה ***

source: Building: %1
eo: Konstruante: %1
he: מתבצעת בנייה: %1

source: Could not find PIC with ID "%1".
eo: Ne eblis trovi PIC kun ID "%1".
he: לא ניתן למצוא PIC עם המזהה „%1”.

source: Compilation failed. Please check you have sdcc installed.
eo: Kompilo malsukcesis. Bonvolu kontroli, ke vi havas sdcc instalitan.
he: ההידור נכשל. נא לבדוק ש־sdcc מותקן.

source: Circular 2-Wheel Chassis
eo: Cirkla 2-Rado Ĉasio
he: מארז עגול עם שני גלגלים

source: Chassis'
eo: Ĉasio'
he: של המארז

source: Mass
eo: Maso
he: מסה

source: Moment of Inertia
eo: Momento de Inercio
he: מומנט ההתמדה

source: Advanced...
eo: Plie...
he: מתקדם…

source: Do not know how to build "%1" (output URL is empty).
eo: Ne scias kiel konstrui "%1" (eliga URL estas malplena).
he: לא ברור איך לבנות את „%1” (כתובת הפלט ריקה).

source: Do not know how to build "%1" (library does not exist in project).
eo: Ne scias kiel konstrui "%1" (biblioteko ne ekzistas en projekto).
he: לא ברור איך לבנות את „%1” (הספרייה לא קיימת במיזם).

source: Do not know how to build "%1" (unknown output type).
eo: Ne scias kiel konstrui "%1" (nekonata eligotipo).
he: לא ברור איך לבנות את „%1” (סוג הפלט לא ידוע).

source: Project could not be saved to "%1"
eo: Projekto ne povis esti konservita al "%1"
he: לא ניתן לשמור את המיזם אל „%1”

source: Saving Project
eo: Konserva Projekto
he: שמירת מיזם

source: Displays the list of files in the project. To open or close a project, use the "Project" menu. Right click on a file to remove it from the project
he: הצגת רשימת הקבצים במיזם. כדי לפתוח או לסגור מיזם, יש להשתמש בתפריט „מיזם”. משם ללחוץ לחיצה ימנית על קובץ כדי להסיר אותו מהמיזם

source: Project Manager
eo: Projektadministrilo
he: מנהל המיזמים

source: KTechlab Project
eo: KTechlab Projekto
he: מיזם KTechlab

source: Do you really want to remove "%1"?
eo: Ĉu vi vere volas forigi "%1"?
he: להסיר את „%1”?

source: Remove Project File?
eo: Ĉu forigi Projektan Dosieron?
he: להסיר קובץ מיזם?

source: Failed to create editor
eo: Malsukcesis krei redaktilon
he: יצירת העורך נכשלה

source: Unknown code type.
eo: Nekonata kodotipo.
he: סוג הקוד לא ידוע.

source: Cannot debug
eo: Ne povas sencimigi
he: לא ניתן לנפות שגיאות

source: Cannot debug hex.
eo: Ne povas sencimigi heks.
he: לא ניתן לנפות שגיאות בהקסה.

source: Format Assembly Code
eo: Formato Asemblea Kodo
he: עיצוב קוד אסמבלי

source: Set &Breakpoint
eo: Agordi Rompo&punkton
he: הגדרת &נקודת עצירה

source: Run
eo: Ruli
he: הרצה

source: Stop
eo: Halti
he: עצירה

source: Step Over
eo: Paŝi super
he: דילוג מעבר

source: Step Out
eo: Paŝi ele
he: צעידה החוצה

source: Line: %1 Col: %2
eo: Linio: %1 Kol: %2
he: שורה: %1 עמודה: %2

source: Clear &Breakpoint
eo: Viŝi Romp&punkton
he: מ&חיקת נקודת עצירה

source: True
eo: Vere
he: חיובי

source: False
eo: Malvera
he: שלילי

source: (empty)
eo: (malplena)
he: (ריק)

source: Open Document
eo: Malfermi Dokumenton
he: פתיחת מסמך

source: Microbe
eo: Mikrobo

source: Rising Trigger Threshold
eo: Altiĝanta Trigger Sojlo

source: Falling Trigger Threshold
eo: Falanta Trigger Sojlo

source: Logic Output High
eo: Logika Eligo Alta

source: Logic Output High Impedance
eo: Logika Eligo Alta Impedanco

source: Logic Output Low Impedance
eo: Logika Eligo Malalta Impedanco

source: Passive
eo: Pasivo

source: Discrete
eo: Diskreta

source: Forward Coefficient
eo: Antaŭa Koeficiento

source: Reverse Coefficient
eo: Inversa koeficiento

source: Forward Beta
eo: Antaŭen Beta

source: Reverse Beta
eo: Inversa Beta

source: N-Channel JFET
eo: N-kanalo JFET

source: P-Channel JFET
eo: P-kanalo JFET

source: PN emission coefficient
eo: PN-emisiokoeficiento

source: Isr emission coefficient
eo: Isr-emisiokoeficiento

source: N-Channel Depletion MOSFET
eo: N-Kanala Malplenigo MOSFET

source: P-Channel Depletion MOSFET
eo: P-Kanalo Malplenigo MOSFET

source: FlowCode
eo: Fluokodo

source: Scaling
eo: Skalado

source: Logic Probe
eo: Logika Sondilo

source: Push-to-Break
eo: Puŝo-al-Rompi

source: Push to Break
eo: Premu por Rompi

source: Bounce
eo: Resalto

source: Bounce Period
eo: Resalta Periodo

source: Push-to-Make
eo: Puŝ-al-Fari

source: Push to Make
eo: Premu por Fari

source: Resistor DIP
eo: Rezistaro DIP

source: Pulse
eo: Pulso

source: Pulse %1 for %2 sec
eo: Pulso %1 dum %2 sek

source: Unary
eo: Unuloka

source: Raise the &appropriate item selector on creating a new document
eo: Levi la t&aŭgan elektilon dum kreado de nova dokumento

source: Flow Part
eo: Flua Parto

source: Distinctive
eo: Distinga

source: Falling Trigger Threshold:
eo: Falanta Ellasilo:

source: Rising Trigger Threshold:
eo: Altiĝanta ellasila sojlo:

source: Zoom
eo: Zomo

source: Disable overlaying leaf function &auto variables (--nooverlay)
eo: Malebligi supermetantan folian funkcion &aŭtomatajn variablojn (--nooverlay)

source: Disable loop variable induction (--noinduction)
eo: Malebligi buklan varian indukton (--noinduction)

source: Ena&ble inline assembly peephole optimization (--peep-asm)
eo: E&bligi la optimumigon de enlinia kunigo (--peep-asm)

source: Lowest (%1 FPS)
eo: Plej malalta (%1 FPS)

source: Low (%1 FPS)
eo: Malalta (%1 FPS)

source: Flow Parts
eo: Fluaj Partoj

source: AND
eo: KAJ

source: OR
eo: AŬ

source: 555s
eo: 555-oj

source: JFETs
eo: JFEToj

source: MOSFETs
eo: MOSFEToj

source: Failed to create MarkInterface
eo: Malsukcesis krei MarkInterface
