Repository: ktechlab/ktechlab
Catalog: po/*/ktechlab.po
Languages: eo, he

# NAME OF TRANSLATORS
source: Your names
eo: Oliver Kellogg
he: צוות התרגום של KDE ישראל

# EMAIL OF TRANSLATORS
source: Your emails
eo: olivermkellogg@gmail.com
he: kde-l10n-he@kde.org

source: The Microbe Compiler
eo: La Mikroba Kompililo
he: המהדר Microbe

source: (C) 2004-2005, The KTechlab developers
eo: (C) 2004-2005, La KTechlab-programistoj
he: ‏(C) 2004‏-2005, מפתחי KTechlab

source: Daniel Clarke
he: דניאל קלארק

source: David Saxton
he: דיויד סקסטון

source: George John
eo: Georgo Johano
he: ג׳ורג׳ ג׳ון

source: Added pic 16f877,16f627 and 16f628
eo: Aldonita bildo 16f877,16f627 kaj 16f628
he: נוספו pic 16f877,16f627 ו־16f628

source: Show source code lines in assembly output
eo: Montri fontkodliniojn en asembla eligo
he: הצגת שורות קוד המקור בפלט אסמבלי

source: Do not attempt optimization of generated instructions.
eo: Ne provi optimumigon de generitaj instrukcioj.
he: לא לנסות למטב את ההנחיות שנוצרות.

source: Input filename
eo: Eniga dosiernomo
he: שם קובץ קלט

source: Output filename
eo: Eliga dosiernomo
he: שם קובץ פלט

source: Could not open file '%1'
eo: Ne eblis malfermi dosieron '%1'
he: לא ניתן לפתוח את הקובץ „%1”

source: Unknown statement
eo: Nekonata deklaro
he: הכרזה לא ידועה

source: Port '%1' is not supported by target PIC
eo: Pordo '%1' ne estas subtenata de cela PIC
he: הפתחה ‚%1’ לא נתמכת על ידי PIC היעד

source: Pin identifier was not followed by '='
eo: Pinglo-identigilo ne estis sekvita de '='
he: לא נוסף ‚=’ אחרי מזהה הפין

source: Pin state can only be 'high' or 'low'
eo: Pinglostato povas esti nur "alta" aŭ "malalta"
he: מצב הפין יכול להיות רק ‚גבוה’ (high) או ‚נמוך’ (low)

source: Invalid token '%1'. Port identifier should be followed by '='
eo: Nevalida signo '%1'. Portidentigilo devas esti sekvita per '='
he: האסימון ‚%1’ שגוי. אחרי מזהה הפתחה אמור להיות ‚=’

source: Unexpected statement before '{'
eo: Neatendita deklaro antaŭ '{'
he: הכרזה לא צפויה לפני ‚{’

source: Mismatched brackets in expression '%1'
eo: Miskongruaj krampoj en esprimo '%1'
he: כמות לא מאוזנת של סוגריים מרובעים בביטוי ‚%1’

source: Invalid '=' found in expression
eo: Nevalida '=' trovita en esprimo
he: נמצא ‚=’ שגוי בביטוי

source: Reserved keyword '%1' cannot be a variable name.
eo: Rezervita ŝlosilvorto '%1' ne povas esti variablo nomo.
he: מילת המפתח השמורה ‚%1’ לא יכולה להיות שם משתנה.

source: Nothing between operators
eo: Nenio inter operatoroj
he: אין שום דבר בין הפעולות

source: Missing operator or space in operand
eo: Mankas operatoro aŭ spaco en operando
he: חסרה פעולה או רווח באופרנד

source: Unknown variable
eo: Nekonata variablo
he: משתנה לא ידוע

source: Unknown variable '%1'
eo: Nekonata variablo '%1'
he: המשתנה ‚%1’ לא ידוע

source: Could not open include file '%1'
eo: Ne eblis malfermi inkluzivi dosieron '%1'
he: לא ניתן לפתוח את קובץ ההכללה (include) ‏‚%1’

source: Division by zero
eo: Divido per nulo
he: חלוקה באפס

source: Number too big
eo: Nombro tro granda
he: המספר גדול מדי

source: Step can only be a constant expression
eo: Paŝo povas esti nur konstanta esprimo
he: צעד יכול להיות ביטוי קבוע בלבד

source: Delay must be a positive constant value
eo: Prokrasto devas esti pozitiva konstanta valoro
he: השהיה חייבת להיות ערך חיובי קבוע

source: 'high' or 'low' expected after pin expression '%1'
eo: 'alta' aŭ 'malalta' atendita post pingla esprimo '%1'
he: אמור להיות ‚high’ (גבוה) או ‚low’ (נמוך) אחרי ביטוי הפין ‚%1’

source: Comparison operator in '%1' is not recognized
eo: Kompara operatoro en '%1' ne estas rekonita
he: פעולת ההשוואה תחת ‚%1’ לא מזוהה

source: Subroutine definition before end of program
eo: Subprograma difino antaŭ fino de programo
he: הגדרת תת־שגרה לפני סוף התוכנית

source: Interrupt routine definition before end of program
eo: Interromp-rutina difino antaŭ fino de programo
he: הגדרת שגרת פסיקה לפני סוף התוכנית

source: Label expected
eo: Etikedo atendita
he: אמורה להיות תווית

source: Extra tokens at end of line
eo: Kromaj ĵetonoj ĉe fino de linio
he: אסימונים עודפים בסוף השורה

source: Expected '%1'
eo: Atendita '%1'
he: אמור להיות ‚%1’

source: Pin list expected
eo: Listo de pinglo atendita
he: אמורה להיות רשימת פינים

source: Alias already defined
eo: Kaŝnomo jam difinita
he: הכינוי כבר הוגדר

source: Interrupt type not supported by target PIC
eo: Interrompa tipo ne subtenata de cela PIC
he: סוג הפסיקה לא נתמך על ידי PIC היעד

source: Interrupt already defined
eo: Interrompo jam difinita
he: הפסיקה כבר הוגדרה

source: Variable '%1' is read only
eo: La variablo '%1' estas nur legata
he: המשתנה ‚%1’ הוא לקריאה בלבד

source: Variable '%1' is write only
eo: La variablo '%1' estas nur skriba
he: המשתנה ‚%1’ הוא לכתיבה בלבד

source: Invalid pin list size
eo: Nevalida pingla listogrando
he: גודל רשימת הפינים שגוי

source: Variable '%1' is already defined
eo: Variablo '%1' jam estas difinita
he: המשתנה ‚%1’ כבר מוגדר

source: '%1' is not a valid variable name
eo: '%1' ne estas valida variablo nomo
he: ‚%1’ אינו שם תקף למשתנה

source: Variable expected
eo: Variablo atendata
he: אמור להיות משתנה

source: Name expected
eo: Nomo atendita
he: אמור להיות שם

source: Internal issue: Optimization has not finished in %1 iterations.
eo: Interna problemo: Optimumigo ne finiĝis en %1 ripetoj.
he: תקלה פנימית: המיטוב לא סיים תוך %1 חזרות.

source: Dump linear equations
eo: Dump linearaj ekvacioj
he: היטל משוואות לינאריות

source: 0 Degrees
he: 0 מעלות

source: 90 Degrees
he: 90 מעלות

source: 180 Degrees
eo: 180 Gradoj
he: 180 מעלות

source: 270 Degrees
eo: 270 Gradoj
he: 270 מעלות

source: Create Subcircuit
eo: Krei Subcirkviton
he: יצירת תת־מעגל

source: Rotate Clockwise
eo: Rotacii dekstrume
he: הטיה עם כיוון השעון

source: Rotate Counter-Clockwise
eo: Rotacii Maldekstrume
he: הטיה נגד כיוון השעון

source: Flip Horizontally
eo: Turni Horizontale
he: היפוך אופקי

source: Flip Vertically
eo: Turni Vertikale
he: היפוך אנכי

source: Simulation Initializing
eo: Simulado Inicialigo
he: ההדמיה מתחילה

source: Simulation Running
eo: Simulado Kurado
he: ההדמיה רצה

source: Simulation Paused
eo: Simulado Paŭzita
he: ההדמיה מושהית

source: Maximum number of undo steps
eo: Maksimuma nombro da malfari paŝoj
he: המספר המרבי של צעדים להסגה

source: Restore Documents on Startup
eo: Restarigi Dokumentojn ĉe Ekfunkciigo
he: שחזור מסמכים עם ההפעלה

source: Raise appropriate Item Selector on document creation
eo: Levi taŭgan Element-Elektilon dum kreado de dokumentoj
he: הרמת בורר פריטים מתאים

source: Raise Messages Log on Compiling
eo: Levi Mesaĝprotokolon je Kompilado
he: הרמת יומן הודעות בעת הידור

source: Show Voltage Bars
eo: Montri Tensiajn Bretojn
he: הצגת עמודות מתח

source: Show Voltage as Color
eo: Montri Tension kiel Koloron
he: הצגת מתח כצבע

source: Animate Wires (current or power)
eo: Animaci Dratojn (nuntaj aŭ potenco)
he: הנפשת חוטים (זרם או חשמל)

source: Refresh Rate
eo: Refreŝiga indico
he: קצב ריענון

source: Color of grid lines
eo: Koloro de kradlinioj
he: צבע קווי הרשת

source: Whether the grid should be shown.
eo: Ĉu la krado devus esti montrita.
he: האם להציג רשת.

source: Whether the same output should be use for generation of code, etc
eo: Ĉu la sama eligo devus esti uzata por generacio de kodo, ktp
he: האם אותו הפלט אמור לשמש ליצירת קוד וכו׳

source: Indentation of Instruction Names
eo: Deŝovo de Instrukciaj Nomoj
he: הזחה של שמות הנחיות

source: Indentation of Instruction Data
eo: Deŝovo de Instrukciaj Datumoj
he: הזחה של נתוני הנחיות

source: Indentation of Comments
eo: Deŝovo de Komentoj
he: הזחה של הערות

source: Indentation of 'equ'
eo: Deŝovo de "equ"
he: הזחה של ‚equ’

source: Indentation of 'equ' Value
eo: Deŝovo de 'equ' Valoro
he: הזחה של ערך ‚equ’

source: Automatically format Microbe output
eo: Aŭtomate formatigi Microbe-eligon
he: עיצוב פלט Microbe אוטומטית

source: Logic Symbol Shapes
eo: Logika Simbolo Formoj
he: צורות סימנים לוגיים

source: Hex Format
eo: Hex Formato
he: תבנית הקסדצימלית

source: Radix
he: בסיס

source: GpasmWarning Level
eo: GpasmAverta Nivelo
he: רמת GpasmWarning

source: Ignore Case
eo: Ignori Usklecon
he: התעלמות מרישיות

source: Dos Formatting
eo: Dos-Formatado
he: תבנית Dos

source: Other Options
eo: Aliaj Opcioj
he: אפשרויות אחרות

source: Do not search in the standard library directory
eo: Ne serĉu en la norma biblioteka dosierujo
he: לא לחפש בתיקיית הספרייה התקנית

source: Do not search in the standard include directory
eo: Ne serĉu en la norma inkluziva dosierujo
he: לא לחפש בתיקיית ההכללה/include התקנית

source: Disable pedantic warnings
eo: Malebligi pedantajn avertojn
he: השבתת אזהרות קטנוניות

source: Strictly follow the C89 standard
eo: Strikte sekvi la C89-normon
he: להיצמד לתקן C89 באדיקות

source: Strictly follow the C99 standard
eo: Strikte sekvi la C99-normon
he: להיצמד לתקן C99 באדיקות

source: Stack automatic variables
eo: Staki aŭtomatajn variablojn
he: עריכת משתנים אוטומטית

source: Integer libraries have been compiled as reentrant
eo: Entjerbibliotekoj estis kompilitaj kiel reeniranto
he: ספריות מספרים שלמים וחיוביים הודרו בתור רב־כניסה

source: Floating point library has been compiled as reentrant
eo: Glitkoma biblioteko estis kompilita kiel reeniranto
he: ספריית הנקודה הצפה הודרה בתור רב־כניסה

source: Leave out the frame pointer
eo: Preterlasi la kadran montrilon
he: להשאיר את מצביע המסגרת כמו שהוא

source: Do not memcpy initialized data from code space to xdata space
eo: Ne memcpy pravigitaj datumoj de koda spaco al xdata spaco
he: לא לבצע העתקת זיכרון של נתונים מאותחלים ממרחב קוד (code) למרחב xdata

source: Callee will always save registers used
eo: Alvokito ĉiam konservos la uzitajn registrojn
he: הקורא תמיד ישמור את האוגרים שהיו בשימוש

source: Do not overlay parameters and local variables
eo: Ne supermeti parametrojn kaj lokajn variablojn
he: לא לדרוס פרמטרים ומשתנים מקומיים

source: Disable the GCSE optimization
eo: Malebligi la GCSE-optimumigon
he: השבתת מיטובי GCSE‏

source: Do not optimize labels
eo: Ne optimumigi etikedojn
he: לא למטב תוויות

source: Disable optimization of invariants
eo: Malebligi optimumigon de invariantoj
he: השבתת מיטוב משתמרים/אינווריאנטים

source: Disable loop variable induction
eo: Malebligi buklovariablan indukton
he: השבתת הסקה של משתני לולאה

source: Disable peep-hole optimization
eo: Malebligi peep-truan optimumigo
he: השבתת מיטוב „חור הצצה”

source: Do not do loop reversal optimization
eo: Ne fari buklan inversan optimumigon
he: לא לבצע מיטוב היפוך לולאה

source: Optimize for compact code
eo: Optimumigi por kompakta kodo
he: מיטוב לקוד חסכוני

source: Optimize for fast code
eo: Optimumigi por rapida kodo
he: מיטוב לקוד מהיר

source: Pass inline assembler code through peep hole optimizer
eo: Transiri enlinian asembleblan kodon per kaŝtrua optimumiganto
he: העברת קוד אסמבלי משולב דרך ממטב חור הצצה

source: Do not generate boundary check for jump tables
eo: Ne generi limkontrolon por saltotabeloj
he: לא לייצר בדיקת גבולות לטבלאות קפיצה

source: Do not use default libraries
eo: Ne uzi defaŭltajn bibliotekojn
he: לא להשתמש בספריות ברירת המחדל

source: Do not generate BANKSEL directives
eo: Ne generi BANKSEL-direktivojn
he: לא לייצר הנחיות BANKSEL

source: Use large stack model
eo: Uzi grandstakan modelon
he: להשתמש בדגם ערימה גדולה

source: Show more debug info in assembly output
eo: Montri pliajn sencimigajn informojn en asembla eligo
he: הצגת פרטי ניפוי שגיאות נוספים בפלט אסמבלי

source: Explicit enable of peepholes
eo: Eksplicita ebligo de okultruoj
he: הפעלה מפורשת של חורי הצצה

source: Dump call tree in .calltree file
eo: Elĵeti vokarbon en .calltree-dosiero
he: להטיל את עץ הקריאות לקובץ ‎.calltree

source: Enable stack optimizations
eo: Ebligi stakajn optimumigojn
he: הפעלת מיטובי ערימה

source: Try to use conditional BRA instead of GOTO
eo: Provi uzi kondiĉan BRA anstataŭ GOTO
he: כדאי לנסות להשתמש ב־BRA מותנה במקום ב־GOTO

source: Try to optimize some compares
eo: Provi optimumigi kelkajn komparojn
he: לנסות למטב חלק מההשוואות

source: Thorough data flow analysis
eo: Plena analizo de fluo de datumoj
he: אבחון תזרים נתונים יסודי

source: Search / include non-free licensed libraries and header files
eo: Serĉu / inkluzivi neliberajn licencitajn bibliotekojn kaj kapdosierojn
he: לחפש / לכלול (include) ספריות וקובצי כותרות (header) שכפופים לרישיונות לא חופשיים

source: Location where SDCC in installed
eo: Loko kie SDCC estas instalita
he: המקום בו מותקן ה־SDCC

source: The application to use to program the PIC.
eo: La aplikaĵo por programi la PIC.
he: היישום לשימוש לתכנות ה־PIC.

source: The device (serial, parallel, etc...) used to program the PIC.
eo: La aparato (seria, paralela, ktp...) uzata por programi la PIC.
he: ההתקן (טורי, מקבילי, וכו׳) שמשמש לתכנות ה־PIC.

source: Check this if SDCC uses shared libs for compiling (newer SDCC does so)
eo: Marku ĉi tion se SDCC uzas komunajn libojn por kompili (pli nova SDCC faras tion)
he: יש לסמן את זה אם SDCC משתמש בספריות משותפות להידור (גרסאות חדשות יותר של SDCC עושות את זה)

source: An IDE for microcontrollers and electronics
eo: IDE por mikroregiloj kaj elektronikaĵoj
he: סביבת פיתוח משולבת לבקרים מזעריים ואלקטרוניקה

source: (C) 2003-2017, The KTechLab developers
eo: (C) 2003-2017, La programistoj de KTechLab
he: ‏(C) 2003‏-2017, מפתחי KTechlab

source: Alan Grimes
he: אלן גריימס

source: Developer, Simulation
eo: Ellaboranto, Simulado
he: מפתח, הדמיה

source: Zoltan Padrah
he: זולטן פדרה

source: Developer
eo: Ellaboranto
he: מפתח

source: Julian Bäume
he: יוליאן בוימה

source: Developer, KDE4 Port, GUI
eo: Programisto, KDE4 Portado, GUI
he: מפתח, הסבה ל־KDE4, ממשק משתמש

source: Juan De Vincenzo
he: חואן דה וינצ׳נזו

source: KDE4 Port
eo: KDE4 Portado
he: הסבה ל־KDE4

source: Lawrence Shafer
he: לורנס שייפר

source: Website, wiki and forum
eo: Retejo, vikio kaj forumo
he: אתר, ויקי ופורום

source: Jason Lucas
he: ג׳ייסון לוקאס

source: Keeping up the project during lack of developers
eo: Daŭrigante la projekton dum manko de programistoj
he: תחזוקת המיזם בהעדר מפתחים

source: Former developer, project founder, former maintainer
eo: Iama programisto, projektofondinto, iama prizorganto
he: מפתח לשעבר, יוצר המיזם, מתחזק לשעבר

source: Former developer
eo: Iama programisto
he: מפתח לשעבר

source: Couriousous
eo: Kuriĝema
he: סקרנות

source: JK flip-flop, asynchronous preset/reset in the D flip-flop
eo: JK-flip-flopo, nesinkrona antaŭmetita/restarigita en la D-flip-flopo
he: דלגלג JK, הגדרה מראש/איפוס אסינכרוניים בדלגלג D

source: Rotary Switch
eo: Rotacia Ŝaltilo
he: מפסק סיבובי

source: John Myers
he: ג׳ון מאיירס

source: Glib friendliness
eo: Glib amikeco
he: ידידותיות מול Glib

source: David Leggett
he: דיויד לגט

source: Former website hosting and feedback during early development
eo: Iama reteja gastigado kaj sugestoj dum frua evoluo
he: אירוח לשעבר של האתר ומשוב במהלך הפיתוח הראשוני

source: Document to open.
eo: Dosiero malfermenda.
he: מסמך לפתיחה.

source: Could not open '%1'
eo: Ne eblis malfermi '%1'
he: לא ניתן לפתוח את ‚%1’

source: Untitled (Circuit %1)
eo: Sentitola (Cirkvito %1)
he: ללא שם (מעגל %1)

source: Untitled (Circuit)
eo: Sentitola (Cirkvito)
he: ללא שם (מעגל)

source: Untitled (FlowCode %1)
eo: Sentitola (FlowCode %1)
he: ללא שם (FlowCode %1)

source: Untitled (FlowCode)
eo: Sentitola (FlowCode)
he: ללא שם (FlowCode)

source: Untitled (Mechanics %1)
eo: Sentitola (Mekaniko %1)
he: ללא שם (מכניקה %1)

source: Untitled (Mechanics)
eo: Sentitola (Mekaniko)
he: ללא שם (מכניקה)

source: Untitled (%1)
eo: Sentitola (%1)
he: ללא שם (%1)

source: Untitled
eo: Sentitola
he: ללא שם

source: Could not open Circuit file "%1"
eo: Ne eblis malfermi Cirkvitan dosieron "%1"
he: לא ניתן לפתוח את קובץ המעגל: „%1”

source: Could not open FlowCode file "%1"
eo: Ne eblis malfermi FlowCode-dosieron "%1"
he: לא ניתן לפתוח את קובץ ה־FlowCode‏: „%1”

source: Could not open Mechanics file "%1"
eo: Ne eblis malfermi Mechanics-dosieron "%1"
he: לא ניתן לפתוח את קובץ המכניקה: „%1”

source: Could not open text file "%1"
eo: Ne eblis malfermi tekstdosieron "%1"
he: לא ניתן לפתוח את קובץ הטקסט „%1”

source: Save Location
eo: Konservejo
he: מקום שמירה

source: A file named "%1" already exists. Are you sure you want to overwrite it?
he: כבר קיים קובץ בשם „%1”. לשכתב אותו?

source: Overwrite File?
eo: Ĉu anstataŭigi dosieron?
he: לשכתב קובץ?

source: The document '%1' has been modified. Do you want to save it?
he: המסמך ‚%1’ נערך. לשמור אותו?

source: Save Document?
eo: Ĉu konservi dokumenton?
he: לשמור את המסמך?

source: Other
eo: Alia
he: אחר

source: Image
eo: Bildo
he: תמונה

source: Image File
eo: Bilda Dosiero
he: קובץ תמונה

source: Line
eo: Linio
he: קו

source: Line Color
eo: Linia Koloro
he: צבע קו

source: Line Width
eo: Linia Larĝo
he: עובי קו

source: Line Style
eo: Linia Stilo
he: סגנון קו

source: Cap Style
eo: Ĉapa Stilo
he: סגנון קצה

source: Arrow
eo: Sago
he: חץ

source: Head angle
eo: Kapangulo
he: זווית ראש

source: Canvas Text
eo: Kanvasa Teksto
he: טקסט במשטח ציור

source: Text
eo: Teksto
he: טקסט

source: Display Background
eo: Montri Fonon
he: רקע תצוגה

source: Background Color
eo: Fona Koloro
he: צבע רקע

source: Frame Color
eo: Kadra Koloro
he: צבע מסגרת

source: Solid
eo: Solida
he: אחיד

source: None
eo: Neniu
he: ללא

source: Dash
eo: Streketo
he: מקווקוו

source: Dot
eo: Punkto
he: נקודה

source: Dash Dot
eo: Streketo punkto
he: קו נקודה

source: Dash Dot Dot
eo: Streketo punkto punkto
he: קו נקודה נקודה

source: Flat
eo: Plata
he: שטוח

source: Square
eo: Kvadrato
he: ריבועי

source: Round
eo: Ronda
he: מעוגל

source: Rectangle
eo: Rektangulo
he: מרובע

source: Ellipse
eo: Elipso
he: אליפסה

source: Orientation
eo: Orientiĝo
he: כיוון

source: All Files
eo: Ĉiuj dosieroj
he: כל הקבצים

source: Circuit
eo: Cirkvito
he: מעגל

source: No components were found in the selection.
eo: Neniuj komponantoj estis trovitaj en la elekto.
he: לא נמצאו רכיבים בבחירה.

source: No External Connection components were found in the selection.
eo: Neniuj komponantoj de Eksteraj Konekto estis trovitaj en la elekto.
he: לא נמצאו רכיבי חיבור חיצוניים בבחירה.

source: Integrated Circuits
eo: Integritaj Cirkvitoj
he: מעגלים משולבים

source: Analog-Digital
eo: Analoga-Cifereca
he: אנלוגי-דיגיטלי

source: Digital-Analog
eo: Cifereca-Analoga
he: דיגיטלי-אנלוגי

source: Number Bits
eo: Nombraj Bitoj
he: סיביות מספרים

source: Input Range
eo: Eniga Gamo
he: טווח קלט

source: Bidirectional LED
eo: Dudirekta LED
he: נורית דו־כיוונית

source: Outputs
eo: Eligoj
he: פלטים

source: Color 1
eo: Koloro 1
he: צבע 1

source: Colour 2
eo: Koloro 2
he: צבע 2

source: Binary Counter
eo: Binara Nombrilo
he: מונה בינרי

source: Rising
eo: Leviĝanta
he: עולה

source: Falling
eo: Falanta
he: יורד

source: Bit Count
eo: Bitkalkulo
he: ספירת סיביות

source: Bus
eo: Buso
he: אפיק

source: Connections
eo: Konektoj
he: חיבורים

source: Size
eo: Grandeco
he: גודל

source: Capacitor
eo: Kondensilo
he: קבל

source: Capacitance
eo: Kapacitanco
he: קיבול

source: Demultiplexer
eo: Malmultipleksilo
he: נוטל ריבוב

source: Address Size
eo: Adresa Grandeco
he: גודל כתובת

source: Gain
eo: Gajno
he: שבח

source: Sources
eo: Fontoj
he: מקורות

source: Current Controlled Current Source
eo: Kurente Regata Kurentofonto
he: מקור זרם מבוקר זרם

source: Current Controlled Voltage Source
eo: Kurente Regata Tensiofonto
he: מקור מתח מבוקר זרם

source: Voltage Controlled Current Source
eo: Tensie Regata Kurentofonto
he: מקור זרם מבוקר מתח

source: Voltage Controlled Voltage Source
eo: Tensie Regata Tensiofonto
he: מקור מתח מבוקר מתח

source: Logic
eo: Logiko
he: לוגי

source: Inverter
eo: Invetilo
he: מהפך

source: Buffer
eo: Bufro
he: חוצץ

source: Logic Input
eo: Logika Enigo
he: קלט לוגי

source: Use Toggle
eo: Uzi Baskulon
he: להשתמש במתג

source: Logic Output
eo: Logika Eligo
he: פלט לוגי

source: BCD to 7 Segment
eo: BCD al 7 Segmento
he: BCD ל־7 מקטעים

source: BCD to Seven Segment
eo: BCD al Sep Segmento
he: BCD לשבעה מקטעים

source: NPN Transistor
eo: NPN-Transistoro
he: טרנזיסטור NPN

source: PNP Transistor
eo: PNP-Transistoro
he: טרנזיסטור PNP

source: Saturation Current
eo: Satura Kurento
he: זרם רוויה

source: Clock Input
eo: Enigo de Horloĝo
he: קלט שעון

source: Low Time
eo: Malalta Tempo
he: זמן נמוך

source: High Time
eo: Alta Tempo
he: זמן גבוה

source: Current Signal
eo: Nuna Signalo
he: אות נוכחי

source: Frequency
eo: Frekvenco
he: תדירות

source: Current Range
eo: Nuna Gamo
he: טווח זרם

source: Current Source
eo: Nuna Fonto
he: מקור זרם

source: Current
eo: Aktuala
he: זרם

source: Diode
eo: Diodo
he: דיודה

source: Emission Coefficient
eo: Emisiokoeficiento
he: מקדם פליטה

source: Breakdown Voltage
eo: Rompa Tensio
he: מתח פריצה

source: Fixed Voltage
eo: Fiksa Tensio
he: מתח קבוע

source: Voltage
eo: Tensio
he: מתח

source: Ground (0V)
eo: Tero (0V)
he: הארקה (0V)

source: Ground
eo: Tero
he: הארקה

source: Threshold voltage
eo: Sojla tensio
he: מתח סף

source: Transcondutance
eo: Transkondukteco
he: מוליכות העברה

source: Saturation current
eo: Satura fluo
he: זרם רוויה

source: Keypad
eo: Klavaro
he: לוח מקשים

source: Switches
eo: Ŝaltiloj
he: מתגים

source: Use Toggles
eo: Uzi baskulojn
he: להשתמש במתגים

source: Columns
eo: Kolumnoj
he: עמודות

source: n-MOSFET
he: טרנזיסטור MOSFET תעלת n

source: p-MOSFET
he: טרנזיסטור MOSFET תעלת p

source: n-d MOSFET
he: טרנזיסטור MOSFET תעלת n-d

source: p-d MOSFET
he: טרנזיסטור MOSFET תעלת p-d

# mosfet body/bulk pin
source: Body Pin
eo: Korpo Pinglo
he: פין גוף

source: Operational Amplifier
eo: Operacia Amplifilo
he: מגבר שרת

source: Potentiometer
eo: Potenciometro
he: פוטנציומר

source: Resistance
eo: Rezisto
he: התנגדות

source: Seven Segment
eo: Sep Segmento
he: שבעה מקטעים

source: Seven Segment LED
eo: Sep Segmenta LED
he: תצוגת שבעה מקטעים

source: Color
eo: Koloro
he: צבע

source: Configuration
eo: Agordo
he: הגדרה

source: Common Cathode
eo: Komuna Katodo
he: קתודה משותפת

source: Common Anode
eo: Komuna Anodo
he: אנודה משותפת

source: Signal Lamp
eo: Signala Lampo
he: מנורת אותות

source: Subcircuit
eo: Subcirkvito
he: תת־מעגל

source: Voltage Signal
eo: Tensia Signalo
he: אות מתח

source: Voltage Range
eo: Tensia Gamo
he: טווח מתח

source: Output
eo: Eligo
he: פלט

source: Peak
eo: Pinto
he: פסגה

source: RMS
he: שורש ממוצע ריבועים (RMS)

source: Battery
eo: Baterio
he: סוללה

source: External Connection
eo: Ekstera Konekto
he: חיבור חיצוני

source: Name
eo: Nomo
he: שם

source: D Flip-Flop
he: דלגלג D

source: D-Type Flip-Flop
eo: D-Tipa Flip-Flop
he: דלגלג מסוג D

source: JK Flip-Flop
he: דלגלג JK

source: JK-Type Flip-Flop
eo: JK-Tipa Flip-Flop
he: דלגלג מסוג JK

source: SR Flip-Flop
he: דלגלג SR

source: Adder
he: מחבר

source: Inductor
eo: Induktilo
he: סליל

source: Inductance
eo: Indukto
he: השראה

source: LED
he: נורית

source: Bar Graph Display
eo: Trinkgrafika Montro
he: תצוגת תרשים עמודות

source: Rows
eo: Vicoj
he: שורות

source: Magnitude Comparator
eo: Granda Komparilo
he: משווה גודל

source: Number Inputs
eo: Nombraj Enigoj
he: קלטי מספרים

source: Matrix Display
eo: Matrica Display
he: תצוגת מטריצה

source: Row Cathode
eo: Vico Katodo
he: קתודת שורות

source: Column Cathode
eo: Kolumna Katodo
he: קתודת עמודות

source: Matrix Display Driver
eo: Matrica Montrilo
he: מנהל התקן תצוגת מטריצה

source: Minimum Value
eo: Minimuma Valoro
he: ערך מזערי

source: Maximum Value
eo: Maksimuma Valoro
he: ערך מרבי

source: Frequency Meter (TODO)
eo: Frekvencmezurilo (TODO)
he: מד תדירות (ממתין לפיתוח)

source: Frequency Meter
eo: Frekvenco-Mezurilo
he: מד תדירות

source: Ammeter
eo: Ampermetro
he: מד זרם

source: Voltmeter
eo: Voltmetro
he: מד מתח

source: XNOR gate
eo: XNOR pordego
he: שער XNOR

source: XOR gate
eo: XOR pordego
he: שער XOR

source: OR gate
eo: AŬ pordego
he: שער OR

source: NOR gate
eo: NOR pordego
he: שער NOR

source: NOR Gate
eo: NOR Pordego
he: שער NOR

source: NAND gate
eo: NAND-pordego
he: שער NAND

source: NAND Gate
eo: NAND Pordego
he: שער NAND

source: AND gate
eo: KAJ pordego
he: שער AND
