Repository: ktechlab/ktechlab
Catalog: po/*/ktechlab.po
Languages: eo, he

source: AND Gate
eo: KAJ Pordego
he: שער AND

source: Multiplexer
eo: Multipleksilo
he: מרבב

source: Parallel Port
eo: Paralela Pordo
he: פתחה מקבילית

source: Port
eo: Pordo
he: פתחה

source: Could not open port %1
eo: Ne eblis malfermi pordon %1
he: לא ניתן לפתוח את הפתחה %1

source: <Enter location of PIC Program>
eo: <Enigu lokon de PIC-Programo>
he: <נא למלא מקום של תוכנית PIC>

source: Program
eo: Programo
he: תוכנית

source: All Supported Files
eo: Ĉiuj Subtenataj Dosieroj
he: כל הקבצים הנתמכים

source: Symbol File
eo: Simbolo Dosiero
he: קובץ סמלים

source: Assembly Code
eo: Asemblea Kodo
he: קוד אסמבלי

source: C Code
eo: C Kodo
he: קוד ב־C

source: The file "%1" does not exist.
eo: La dosiero "%1" ne ekzistas.
he: קובץ „%1” לא קיים.

source: (No program loaded)
he: (לא נטענה תוכנית)

source: Linear
eo: Lineara
he: קווי

source: Logarithmic
eo: Logaritma
he: לוגריתמי

source: Upper Absolute Value
eo: Supra Absoluta Valoro
he: ערך מוחלט עליון

source: Lower Absolute Value
eo: Malsupra Absoluta Valoro
he: ערך מוחלט תחתון

source: Voltage Probe
eo: Tensiosondilo
he: חיישן מתח

source: Current Probe
eo: Nuna Sondo
he: חיישן זרם

source: Button Text
eo: Butona teksto
he: טקסט כפתור

source: RAM
he: זיכרון גישה אקראית

source: Word Size
eo: Vorta Grandeco
he: גודל מילה

source: Resistor
eo: Rezisto
he: נגד

source: Count
eo: Nombro
he: ספירה

source: Rotary
eo: Rotacianta
he: מקודד סיבובי

source: Number of Positions
eo: Nombro de Pozicioj
he: מספר המקומות

source: Serial Port
eo: Seria Pordo
he: פתחה טורית

source: DPDT Toggle
eo: DPDT Baskulo
he: מפסק DPDT

source: DPST Toggle
eo: DPST Baskulo
he: מפסק DPST

source: SPDT Toggle
eo: SPDT Baskulo
he: מפסק SPDT

source: SPST Toggle
eo: SPST Ŝaltilo
he: מפסק SPST

source: Variable Capacitor
eo: Varia Kondensilo
he: קבל משתנה

source: Max
eo: Maks
he: מרבי

source: Min
he: מזערי

source: Variable Resistor
eo: Variebla rezistilo
he: נגד משתנה

source: Voltage Regulator
eo: Reguligilo de Tensio
he: וסת מתח

source: Voltage Out
he: מתח יוצא

source: The cod file "%1" was not found.
eo: La coddosiero "%1" ne estis trovita.
he: קובץ ה־cod‏ „%1” לא נמצא.

source: File Not Found
eo: Dosiero Ne Trovita
he: הקובץ לא נמצא

source: The processor for cod file "%1" is unrecognized.
eo: La procesoro por coddosiero "%1" estas nerekonita.
he: המעבד לקובץ ה־cod‏ „%1” לא ידוע.

source: Unrecognized Processor
eo: Nerekonita Procesoro
he: מעבד לא ידוע

source: The file name "%1" is too long.
eo: La dosiernomo "%1" estas tro longa.
he: שם הקובץ „%1” ארוך מדי.

source: Filename Too Long
eo: Dosiernomo Tro Longa
he: שם הקובץ ארוך מדי

source: The lst file associated with the cod file "%1" was not found.
eo: La lst dosiero asociita kun la coddosiero "%1" ne estis trovita.
he: קובץ ה־lst שמשויך לקובץ ה־cod‏ „%1” לא נמצא.

source: LST File Not Found
eo: LST-dosiero ne trovita
he: קובץ ה־LST לא נמצא.

source: The cod file "%1" is bad.
eo: La coddosiero "%1" estas malbona.
he: קובץ ה־cod‏ „%1” שגוי.

source: Bad File
eo: Malbona Dosiero
he: קובץ פגום

source: The cod file "%1" could not be read from.
eo: La coddosiero "%1" ne estis legebla de.
he: לא ניתן לקרוא מקובץ ה־cod‏ „%1”

source: Unreadable File
eo: Nelegebla Dosiero
he: קובץ בלתי קריא

source: An error occurred with the cod file "%1".
eo: Eraro okazis kun la coddosiero "%1".
he: אירעה שגיאה עם קובץ ה־cod‏ „%1”.

source: Error
eo: Eraro
he: שגיאה

source: Generic
eo: Komuna
he: כללי

source: File
eo: Dosiero
he: קובץ

source: Breakpoint
eo: haltopunkto
he: נקודת עצירה

source: Invalid
eo: Nevalida
he: שגוי

source: Unknown
eo: Nekonata
he: לא ידוע

source: Subcircuits
eo: Subcirkvitoj
he: תת־מעגלים

source: Microbe Code Output
eo: Mikroba Kodo Eligo
he: פלט קוד Microbe

source: Assembly Code Output
eo: Asemblea Kodo Eligo
he: פלט קוד אסמבלי

source: Hex Code Output
eo: Hex Code Eligo
he: פלט קוד הקסה

source: Hex Code
eo: Hekskodo
he: קוד הקסה

source: Convert to...
eo: Konverti al...
he: המרה אל…

source: Convert To
eo: Konverti Al
he: המרה אל

source: Assembly
eo: Asembleo
he: אסמבלי

source: Hex
he: הקסה

source: PIC (upload)
eo: PIC (alŝuto)
he: PIC (העלאה)

source: Common
eo: Ofta
he: משותף

source: Sub Call
eo: Subvoko
he: תת־קריאה

source: Subroutine
eo: Subrutino
he: תת־שגרה

source: Call %1
eo: Voki %1
he: לקרוא ל־%1

source: Functions
eo: Funkcioj
he: פונקציות

source: Trigger
eo: Ekagigo
he: הזנקה

source: Count %1 for %2 sec
eo: Kalkuli %1 dum %2 sek
he: ספירת %1 למשך %2 שניות

source: Delay
eo: Prokrasto
he: השהיה

source: Pause Length
eo: Paŭzo Longo
he: משך השהיה

source: Delay for %1 sec
eo: Prokrasto por %1 sek
he: השהיה למשך %1 שנ׳

source: Embed
eo: Enkonstrui
he: שיבוץ

source: Type
eo: Tipo
he: סוג

source: Code
eo: Kodo
he: קוד

source: // Embedded code:
eo: // Enigita kodo:
he: // קוד משובץ:

source: End
eo: Fino
he: סוף

source: Loops
eo: Bukloj
he: לולאות

source: For
eo: Por
he: למשך

source: For Loop
eo: Por Buklo
he: לולאת למשך

source: Variable
eo: Variablo
he: משתנה

source: Initial Value
eo: Komenca Valoro
he: ערך ראשוני

# for x = 1 to
source: to
eo: al
he: עד

source: End Value
eo: Fina Valoro
he: ערך סופי

source: Step
he: צעד

source: InputButton
eo: Eniga Butono
he: כפתור_קלט

source: Pin
eo: Pinglo
he: פין

source: Continue on %1 %2
eo: Daŭrigi sur %1 %2
he: להמשיך ב־%1 %2

source: Interrupt
eo: Interrompoj
he: פסיקה

source: Interrupt %1
eo: Interrompi %1
he: פסיקה %1

source: Pin map
eo: Alpingla mapo
he: מפת פינים

source: Read %1 to %2
eo: Legi %1 al %2
he: קריאת %1 אל %2

source: Pin Map Editor
he: עורך מפת פינים

source: Duration
eo: Daŭro
he: משך

source: I\/O
he: קלט-פלט

source: Read from Port
eo: Legi el Pordo
he: קריאה מפתחה

source: Read
eo: Legi
he: קריאה

# read from port to x
source: to
eo: al
he: אל

source: Repeat
eo: Ripeti
he: חזרה

source: Operation
eo: Operacio
he: פעולה

source: Value
eo: Valoro
he: ערך

source: repeat until %1 %2 %3
eo: ripeti ĝis %1 %2 %3
he: חזרה עד %1 %2 %3

source: Set Pin State
eo: Agordi Pinglostaton
he: הגדרת מצב פין

source: State
eo: Stato
he: מצב

source: Set %1 %2
eo: Agordi %1 %2
he: הגדרת %1 %2

source: SevenSeg
eo: SepSeg
he: שבעה מקטעים

source: Display %1 on %2
eo: Montri %1 sur %2
he: תצוגת %1 על %2

source: Start
eo: Komenci
he: התחלה

source: Test Pin State
eo: Testi Pinglostaton
he: בדיקת מצב פין

source: Variables
eo: Variabloj
he: משתנים

source: Rotate Left
eo: Turni maldekstre
he: סיבוב שמאלה

source: Rotate Right
eo: Turni dekstre
he: סיבוב ימינה

source: Increment
eo: Pliigo
he: הגדלה

source: Decrement
eo: Dekrementi
he: הקטנה

source: Assignment
eo: Tasko
he: הקצאה

source: Variable Assignment
eo: Varia Tasko
he: הקצאת משתנים

source: Comparison
eo: Komparo
he: השוואה

source: Variable Comparison
eo: Variaĝa Komparo
he: השוואת משתנים

source: While
eo: Dum
he: כל-עוד

source: while %1 %2 %3
eo: dum %1 %2 %3
he: כל-עוד %1 %2 %3

source: Write to Port
eo: Skribi al Pordo
he: כתיבה לפתחה

source: Write
eo: Skribi
he: כתיבה

# write to port
source: to
eo: al
he: אל

source: Write %1 to %2
eo: Skribi %1 al %2
he: כתיבת %1 אל %2

source: The values control the indentation from the left margin of the various types of assembly code.
he: הערכים שולטים בהזחה מהשול השמאלי של הסוגים השונים של קוד אסמבלי.

source: Output Code Indentation
eo: Eligo Kodo Deŝovo
he: הזחת קוד הפלט

source: 'equ' Value
eo: 'equ' Valoro
he: ערך ‚equ’

source: Instruction Data
eo: Instrukciaj Datumoj
he: נתוני הנחיות

source: Comment
eo: Komento
he: הערה

source: Instruction Name
eo: Instrukcia Nomo
he: שם הנחיה

source: &Automatically format Microbe output
eo: &Aŭtomate formatigi Mikroban eligon
he: לעצב את פלט ה־Microbe &אוטומטית

source: Provides context-sensitive help relevant to the current editing being performed.
he: אספקת עזרה תלוית הקשר לעריכה שמתבצעת באותו הרגע.

source: No Item Selected
eo: Neniu Ero Elektita
he: לא נבחרו פריטים

source: Multiple Items
eo: Multoblaj Eroj
he: ריבוי פריטים

source: Reset
eo: Restarigi
he: איפוס

source: Reset item help to last saved changes?
eo: Ĉu restarigi eron-helpon al la lastaj konservitaj ŝanĝoj?
he: לאפס את עזרת הפריט לשינויים האחרונים שנשמרו?

source: Cannot save item description.
eo: Ne povas konservi objektopriskribon.
he: לא ניתן לשמור את תיאור הפריט.

source: Edit
eo: Redakti
he: עריכה

source: Context Help Directory
eo: Kunteksta Helpa Adresaro
he: ספריית עזרה לפי הקשר

source: S&ave
eo: Kons&ervi
he: &שמירה

source: Subproject Details
eo: Subprojektaj Detaloj
he: פרטי תת־מיזם

source: Target File:
eo: Cela Dosiero:
he: קובץ יעד:

source: Type:
eo: Tipo:
he: סוג:

source: Library
eo: Biblioteko
he: ספרייה

source: Reuse the same output view for code generation
eo: Reuzi la saman eligvidon por kodgenerado
he: להשתמש שוב באותה תצוגת הפלט ליצירת קוד

source: The grid color in the work area.
eo: La kradkoloro en la laborareo.
he: צבע הרשת באזור העבודה.

source: Grid Colour
eo: Krada Koloro
he: צבע רשת

source: Show &grid:
eo: Montri &kradon:
he: הצגת &רשת:

source: Maximum undo steps for work area. This does not apply to text documents - that is configurable separately under Configure Editor.
he: צעדי הסגה מרביים לאזור העבודה. לא חל על מסמכי טקסט - אפשר להגדיר את זה בנפרד תחת עורך ההגדרות.

source: Maximum undo steps for work area:
eo: Maksimumaj malfaraj paŝoj por laborareo:
he: צעדי הסגה מרביים לאזור העבודה:

source: Show voltage bars &on electronic components
eo: Montri tensiajn stang&ojn sur elektronikaj komponantoj
he: להציג עמודות מתח על &רכיבים אלקטרוניים

source: Color the wires to match the voltage
eo: Kolori la dratojn por kongrui kun la tensio
he: לצבוע את החוטים כדי להתאים למתח

source: Animate wires to show the current or power flow
eo: Vigligi dratojn por montri la fluon aŭ potencon
he: הנפשת החוטים כדי להציג את הזרם או זרימת החשמל

source: Display Refresh Rate
eo: Montri Refreŝ-Oftecon
he: קצב ריענון תצוגה

source: Refresh rate:
eo: Refreŝiga indico:
he: קצב ריענון:

source: Medium (50 FPS)
eo: Meza (50 FPS)
he: בינוני (50 תמוניות לשנייה)

source: This is the number of times per second that the work area view is updated; a compromise between CPU usage and smoothness of display.
he: זה מספר הפעמים בשנייה שאזור העבודה מתעדכן, פשרה בין עומס על המעבד וחלקלקות התצוגה.

source: Convenience
eo: Komforto
he: נוחות

source: Restore opened doc&uments on startup
eo: Restaŭri malfermitajn dok&umentojn dum ekfunkciigo
he: שחזור מסמכים &פתוחים עם ההפעלה

source: Raise the &Messages log when compiling
eo: Levi la protokolon de &Mesaĝoj dum kompilado
he: הקפצת יומן ההודעות ב&זמן הידור

source: Radix (-r):
eo: Radikso (-r):
he: בסיס (‎-r):

source: Warning level (-w):
eo: Averta nivelo (-w):
he: רמת אזהרה (‎-w):

source: Hex Format (-a):
eo: Heksformato (-a):
he: תבנית הקסדצימלית (‎-a):

source: Ign&ore case (-i)
eo: Ign&ori usklecon (-i)
he: התעלמות מ&רישיות (‎-i)

source: By default, gpasm generates hex files using ISO format. However, some device programmers required a DOS formatted file. This option will cause gpasm to generate a DOS formatted hex file.
he: כברירת מחדל, gpasm מייצר קבצים הקסדצימליים בתבנית ISO. למרות זאת, חלק מצורבי ההתקנים דורשים קובץ בתבנית DOS. האפשרות הזאת תגרום ל־gpasm לייצר קובץ הקסדצימלי בתבנית DOS.

source: Generate DOS-formatted hex file (-&n)
eo: Generi DOS-formatan deksesan dosieron (-&n)
he: יצירת קובץ &הקסדצימלי בתבנית DOS‏ (‎-n)

source: GPASM supports inhx8m, inhx8s, inhx16, and inhx32 hex file formats. This option controls which hex file format is used.
he: ‏GPASM תומך בסוגי הקבצים ההקסדצימליים inhx8m,‏ inhx8s,‏ inhx16 ו־inhx32. האפשרות הזאת שולטת בסוגי הקבצים ההקסדצימליים שיהיו בשימוש.

source: Decimal
eo: Dekuma
he: עשרוני

source: Binary
eo: Duuma
he: בינרי

source: Octal
eo: Okuma
he: אוקטלי

source: Hexadecimal
eo: Deksesuma
he: הקסדצימלי

source: All
eo: Ĉiuj
he: הכול

source: Warnings
eo: Avertoj
he: אזהרות

source: Errors
eo: Eraroj
he: שגיאות

source: Other options:
eo: Aliaj opcioj:
he: אפשרויות אחרות:

source: Link with shared libraries (&use this with new SDCC)
eo: Ligi kun komunaj bibliotekoj (&uzi ĉi tion kun nova SDCC)
he: קישור עם ספריות משותפות (לה&שתמש בזה עם SDCC חדש)

source: Export As Image
eo: Eksporti Kiel Bildon
he: ייצוא כתמונה

source: Format:
eo: Formato:
he: תבנית:

source: File name:
eo: Dosiernomo:
he: שם קובץ:

source: Crop image:
eo: Tondi bildon:
he: חיתוך תמונה:

source: Export
eo: Eksporti
he: ייצוא

source: Filter here...
eo: Filtri ĉi tie...
he: סינון מכאן…

source: Clear filter
eo: Malplenigi filtrilon
he: פינוי מסנן

source: Enter space-separated terms to filter the component library.
eo: Enigu spaco-apartigitajn terminojn por filtri la komponantbibliotekon.
he: נא למלא ביטויים עם רווחים ביניהם כדי לסנן את ספריית הרכיבים.

source: Select a predefined component configuration from this list.
eo: Elektu antaŭdifinitan komponantagordon el ĉi tiu listo.
he: נא לבחור הגדרות רכיב שנקבעו מראש מהרשימה הזאת.

source: This allows editing of advanced properties of the selected item(s). Right click on the picture of the item to set the orientation.
he: מאפשר עריכת מאפיינים מתקדמים של הפריטים הנבחרים. יש ללחוץ על התמונה של הפריט עם הלחצן הימני כדי להגדיר את הכיוון.

source: Change the orientation of the selected item by selecting the appropriate button
he: שינוי כיוון הפריט הנבחר על ידי בחירת הכפתור המתאים

source: Yes
eo: Jes
he: כן

source: No
eo: Ne
he: לא

source: Property
eo: Propreco
he: מאפיין

source: Undo changes
eo: Malfari ŝanĝojn
he: הסגת השינויים

source: Choose File
eo: Elekti dosieron
he: בחירת קובץ

source: Component
eo: Komponanto
he: רכיב

source: Remove %1
eo: Forigi %1
he: הסרת %1

source: Add components to the circuit diagram by dragging them into the circuit.<br><br>To add more than one component of the same type, doubleclick on a component, and click repeatedly in the circuit to place the component. Right click to stop placement.<br><br>Some components (such as subcircuits) can be removed by right clicking on the item and selecting "Remove".
he: אפשר להוסיף רכיבים לתרשים המעגל החשמלי על ידי גרירתם למעגל החשמלי.<br><br>כדי להוסיף יותר מרכיב אחד מאותו הסוג, יש ללחוץ לחיצה כפולה על הרכיב, וללחוץ שוב במעגל כדי להציב את הרכיב. לחיצה ימנית עוצרת את ההצבה. <br><br>חלק מהרכיבים (כגון תת־מעגלים) אפשר להסיר על ידי לחיצה ימנית על הפריט ובחירה ב„הסרה”.

source: Add mechanical parts to the mechanics work area by dragging them there.
eo: Aldoni mekanikajn partojn al la mekanika laborareo trenante ilin tien.
he: אפשר להוסיף חלקים מכניים לאזור העבודה המכנית על ידי גרירתם לכאן.

source: Library Directory (-I):
eo: Biblioteka Adresaro (-I):
he: תיקיית הספריות (‎-I):

source: &Output a map file (-m)
eo: &Eligi mapdosieron (-m)
he: &פלט קובץ מפה (‎-m)

source: Linker Script (-s):
eo: Ligilo-Skripto (-s):
he: סקריפט מקשר (‎-s):

source: Other:
eo: Alia:
he: אחר:

source: Link libraries inside project
eo: Ligi bibliotekojn ene de projekto
he: קישור ספריות בתוך מיזם

source: Logic Symbol Shapes:
eo: Formoj de Logikaj Simboloj:
he: צורות סימנים לוגיים:

source: Rectangular
eo: Rektangula
he: מרובע

source: Input
eo: Enigo
he: קלט

source: Required voltage level before the input will be considered high.
eo: Bezonata tensionivelo antaŭ la enigo estos konsiderita alta.
he: רמת המתח הנדרשת לפני שהקלט ייחשב גבוה.

source: V
he: וולט

source: Required voltage level before an input will be considered low.
eo: Bezonata tensionivelo antaŭ enigo estos konsiderita malalta.
he: רמת המתח הנדרשת לפני שקלט ייחשב נמוך.

source: Voltage level for high on logic components.
eo: Tensia nivelo por alta sur logikaj komponantoj.
he: רמת מתח לגבוה ברכיבים לוגיים.

source: Output High:
eo: Eligo Alta:
he: פלט גבוה:

source: This is the output impedance when the output is high.
eo: Ĉi tiu estas la produktaĵimpedanco kiam la produktaĵo estas alta.
he: זוהי התנגדות המוצא כאשר המוצא נמצא במצב גבוה.

source: High Output Impedance:
eo: Alta Eliga Impedanco:
he: עכבה חשמלית של פלט חזק:

source: This is the output impedance when the output is low.
eo: Ĉi tiu estas la produktaĵimpedanco kiam la produktaĵo estas malalta.
he: זוהי התנגדות המוצא כאשר המוצא נמצא במצב נמוך.

source: Low Output Impedance:
eo: Malalta Eliga Impedanco:
he: עכבה חשמלית של פלט חלש:

source: Floating
eo: Flosanta
he: צף

source: Here, you can configure the behaviour of logic components. These values will apply to all components, apart from the PIC, whose pins' impedances depend on the pin in use.
he: כאן אפשר להגדיר את התנהגות הרכיבים הלוגיים. הערכים האלו חלים על כל הרכיבים, למעט ה־PIC שהעכבה החשמלית של הפינים שלו תלויה בשימוש בפינים.

source: Clear All
eo: Forigi Ĉion
he: פינוי של הכול

source: Microprocessor
eo: Mikroprocesoro
he: מיקרומעבד

source: Family
eo: Familio
he: משפחה

source: Micro
eo: Mikro
he: מיקרו

source: PIC Settings
eo: PIC-agordoj
he: הגדרות PIC

source: This dialog allows editing of the initial properties of the PIC
eo: Ĉi tiu dialogo permesas redakti la komencajn ecojn de la PIC
he: החלונית הזאת מאפשרת לערוך את המאפיינים הראשוניים של ה־PIC

source: Edit the initial value of the variables here.<br><br>Note that the value of the variable can only be in the range 0->255. These variables will be initialized before any other code is executed.
he: עריכת הערך ההתחלתי של המשתנה כאן.<br><br>נא לשים שם שערך המשתנה יכול להיות אך ורק בטווח 0->255. המשתנים האלו יאותחלו לפני שכל קוד שהוא יופעל.

source: Type (TRIS register):
eo: Tipo (TRIS-registro):
he: סוג (אוגר TRIS):

source: State (PORT register):
eo: Stato (PORT-registro):
he: מצב (אוגר PORT):

source: Variable name
eo: Variebla nomo
he: שם משתנה

source: Variable value
eo: Varia valoro
he: ערך משתנה

source: New Pin Mapping
eo: Nova Pinglo-Mapado
he: מיפוי פינים חדש

source: Create
eo: Krei
he: יצירה

source: New Pin Map Name
eo: Nova Pinta Mapo-Nomo
he: שם חדש למיפוי פינים

source: Invalid variable value: %1
eo: Nevalida variablovaloro: %1
he: ערך המשתנה שגוי: %1

source: Tip: Toggle the initial state (high/low) of a pin by clicking its picture. Drag it to set the type (input/output).
he: עצה: אפשר לשנות את המצב ההתחלתי של פין (גבוה/נמוך) בלחיצה על התמונה שלו. יש לגרור אותו כדי להגדיר את הסוג (קלט/פלט).

source: Remove
eo: Forigi
he: הסרה

source: Modif&y
he: &שינוי

source: Rename
eo: Alinomi
he: שינוי שם

source: New File
eo: Nova Dosiero
he: קובץ חדש

source: Select the type of file you wish to create.<br> <p> <b>Pic Program</b><br> Creates a new PIC program, with flow chart editor. Select the target device for your program below. <p> <b>Circuit</b><br> Creates a new circuit, with drag and drop editor. Real time simulation of the circuit occurs automatically.
he: נא לבחור את סוג הקובץ ליצירה.<br> <p> <b>תוכנית Pic</b><br> יצירת תוכנית PIC חדשה עם עורך תרשים זרימה. נא לבחור את התקן היעד לתוכנית שלך להלן. <p> <b>מעגל</b><br> יצירת מעגל חדש, עם עורך עצמים בגרירה. הדמיה של המעגל בזמן אמת מתרחשת אוטומטית.

source: New File Details
eo: Novaj Dosieraj Detaloj
he: פרטי קובץ חדש

source: File Type:
eo: Dosiertipo:
he: סוג קובץ:

source: &Add to project
eo: &Aldoni al projekto
he: הוס&פה למיזם

source: Name:
eo: Nomo:
he: שם:

source: The variable name of the pin mapping - this must be a valid Microbe variable name.
he: שם המשתנה של מיפוי הפינים - חייב להיות שם משתנה תקף של Microbe.

source: Keypad (4x3)
eo: Klavaro (4x3)
he: לוח מקשים (‎4×3)

source: Keypad (4x4)
eo: Klavaro (4x4)
he: לוח מקשים (‎4×4)

source: Final location:
eo: Fina loko:
he: מקום סופי:

source: Location:
eo: Loko:
he: מקום:

source: New Project Details
eo: Novaj Projektaj Detaloj
he: פרטי מיזם חדש

source: Project Name:
eo: Nomo de Projekto:
he: שם מיזם:

source: Oscilloscope
eo: Osciloskopo
he: משקף תנודות

source: Framerate
eo: Framkvanto
he: קצב תמוניות

source: %1 fps
he: %1 תמוניות לשנייה

source: Time Zoom
he: תקריב זמן

source: Displa&y directly
eo: Montr&i rekte
he: הצגה י&שירות

source: Sa&ve to file
eo: Konser&vi al dosiero
he: שמירה ל&קובץ

source: Load File in &New View
eo: Ŝargi Dosierojn en &Nova Vido
he: טעינת קובץ בתצוגה &חדשה

source: &Add to Project
eo: &Aldoni al la projekto
he: הוספה &למיזם

source: &Add ...
eo: &Aldoni...
he: הוס&פה…

source: Re&move
eo: &Forigi
he: ה&סרה

source: Program:
eo: Programo:
he: תוכנית:

source: (Program Description)
eo: (Programa Priskribo)
he: (תיאור תוכנית)

source: Initialization:
eo: Inicialigo:
he: אתחול:

source: Read:
eo: Legu:
he: קריאה:

source: Write:
eo: Skribu:
he: כתיבה:

source: The following strings will be replaced when the command is run: <ul> <li><b>%port</b> - Port that the programmer is connected to</li> <li><b>%device</b> - PIC device</li> <li><b>%file</b> - File to read from or write to</li> </ul>
he: המחרוזות הבאות תוחלפנה בעת הרצת הפקודה: <ul> <li><b>‎%port</b> - פתחה שאליה מחובר הצורב</li> <li><b>‎%device</b> - התקן PIC</li> <li><b>‎%file</b> - קובץ לקרוא ממנו או לכתוב אליו</li> </ul>

source: Erase:
eo: Forigi:
he: מחיקה:

source: Verify:
eo: Konfirmi:
he: אימות:

source: Blank Check:
eo: Blanka Ĉeko:
he: בדיקת ריקים:

source: Default port:
eo: Defaŭlta pordo:
he: פתחת ברירת מחדל:

source: Output File:
eo: Eliga Dosiero:
he: קובץ פלט:

source: PIC Programmer
eo: PIC-Programisto
he: מתכנת PIC

source: Burn
eo: Enskribi
he: צריבה

source: New Project
eo: Nova Projekto
he: מיזם חדש

source: Create Subproject
eo: Krei Subprojekton
he: יצירת תת־מיזם

source: Linker Options
eo: Ligilaj Opcioj
he: אפשרויות מקשר

source: Processing Options
eo: Pretigaj Opcioj
he: אפשרויות עיבוד

source: Bold
eo: Grasa
he: מודגש

source: Italic
eo: Kursiva
he: נטוי

source: Underline
eo: Substrekita
he: קו תחתון

source: List
eo: Listo
he: רשימה

source: Text Alignment
eo: Teksta vicigo
he: יישור טקסט

source: Align Left
eo: Vicigi Maldekstre
he: יישור שמאלה

source: Align Center
eo: Vicigi Centron
he: מירכוז

source: Align Right
eo: Vicigi Dekstren
he: יישור ימינה

source: Align Block
eo: Vicigi Blokon
he: יישור לשני הצדדים

source: Text Vertical Alignment
eo: Teksto Vertikala Alineado
he: יישור טקסט אנכי

source: Superscript
eo: Superskribo
he: כתב עילי

source: Normal
eo: Normala
he: רגיל

source: Subscript
eo: Malalta skribo
he: כתב תחתי

source: Text Color...
eo: Tekstkoloro...
he: צבע טקסט…

source: Intervals
eo: Intervaloj
he: מרווחים

source: Ticks per Interval
eo: Tikoj por Intervalo
he: שנתות למרווח זמן

source: Offset (ticks)
eo: Deŝovo (markoj)
he: היסט (שנתות)

source: Ge&neral
eo: Ĝe&nerala
he: &כללי

source: Do not search in the standard librar&y directory (--nostdlib)
eo: Ne serĉu en la norma biblioteka&y dosierujo (--nostdlib)
he: לא לחפש בתיקיית ה&ספרייה התקנית (‎--nostdlib)

source: Do not search in the standard include directory (--nostdinc)
eo: Ne serĉu en la norma inkluziva dosierujo (--nostdinc)
he: לא לחפש בתיקיית ההכללה/include הרגילה (‎--nostdinc)

source: Disa&ble pedantic warnings (--less-pedantic)
eo: Male&bligi pedantajn avertojn (--less-pedantic)
he: השבתת אזהרות &קטנוניות (‎--less-pedantic)

source: Follow the C89 standard and disable SDCC features that conflict with the standard.
he: להיצמד לתקן C89 ולהשבית את יכולות SDCC שסותרות את התקן.

source: Use C&89 standard only (--std-c89)
eo: Uzi nur C&89-normon (--std-c89)
he: להשתמש בת&קן C89 בלבד (‎--std-c89)

source: Follow the C99 standard and disable SDCC features that conflict with the standard (incomplete support).
he: להיצמד לתקן C99 ולהשבית את יכולות SDCC שסותרות את התקן (תמיכה חלקית).

source: Use C&99 standard only (--std-c99)
eo: Uzi nur C&99-normon (--std-c99)
he: להשתמש ב&תקן C99 בלבד (‎--std-c99)

source: Use non-free licensed libraries and header files (--use-non-free)
eo: Uzi neliberajn aprobitajn bibliotekojn kaj kapdosierojn (--use-non-free)
he: להשתמש בספריות ובקובצי כותרת ברישיון לא חופשי (‎--use-non-free)

source: Code Gener&ation
eo: Kodgener&ado
he: י&צירת קוד
